# Обработка отсутствующих данных

In [9]:
import numpy as np
import pandas as pd

## 1. Разновидности

## `None`

In [10]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [11]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

## `NaN`

In [12]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [13]:
vals2.sum()

nan

In [14]:
np.nansum(vals2)

8.0

## `None` и `NaN` в Pandas

In [15]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [16]:
x = pd.Series(range(2), dtype=int)
x[0] = None
x

0    NaN
1    1.0
dtype: float64

## 2. Операции

### Выявление

In [117]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [118]:
data[data.notnull()]

0        1
2    hello
dtype: object

### Удаление

In [119]:
data.dropna()

0        1
2    hello
dtype: object

In [120]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [122]:
# удалили по умолчанию все строки где есть Na
df.dropna()

     0    1  2
1  2.0  3.0  5

In [123]:
# хотим удалить столбцы
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [124]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [126]:
# отбрасываем все столбцы, где ВСЕ значения Na
df.dropna(axis = 1, how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [128]:
# отбрасываем все строки, где есть хотя бы одно значение Na
df.dropna(how = 'any')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

### Заполнение

In [129]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [130]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [132]:
# заполнение по направлению вперед
data.fillna(method = 'ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [133]:
# заполнение по направлению назад
data.fillna(method = 'bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [135]:
# у одного Na не было пред значения
df.fillna(method = 'ffill', axis = 1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0